## Plan Result (stg_frontdoor)




<pre><code>Plan: 25 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;c100-application&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;darts-portal&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;juror-public&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;pip-frontend&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;pip-frontend-b2c-sign-in&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;pip-frontend-b2c-staff&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;portal-stg&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;pre-portal&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;sds-api-mgmt&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;staging-casetracker&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;staging-certificatedbailiffs&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;staging-courtfines&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;staging-immigrationappealsonline&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;toffee&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;vh-admin-web&#34;]
  * module.premium_front_door.azurerm_dns_txt_record.public_dns_record[&#34;vh-video-web&#34;]
* Update
  * module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin[&#34;staging-immigrationappealsonline&#34;]
  * module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain.custom_domain["juror-public"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "custom_domain" {
      + cdn_frontdoor_profile_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg"
      + expiration_date          = (known after apply)
      + host_name                = "juror-public.staging.platform.hmcts.net"
      + id                       = (known after apply)
      + name                     = "juror-public"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_A["juror-public"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_A" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_custom_domain_association.custom_association_B["juror-public"] will be created
  + resource "azurerm_cdn_frontdoor_custom_domain_association" "custom_association_B" {
      + cdn_frontdoor_custom_domain_id = (known after apply)
      + cdn_frontdoor_route_ids        = (known after apply)
      + id                             = (known after apply)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_firewall_policy.custom["juror-public"] will be created
  + resource "azurerm_cdn_frontdoor_firewall_policy" "custom" {
      + enabled               = true
      + frontend_endpoint_ids = (known after apply)
      + id                    = (known after apply)
      + mode                  = "Prevention"
      + name                  = "jurorpublicstgPremium"
      + resource_group_name   = "lz-stg-rg"
      + sku_name              = "Premium_AzureFrontDoor"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/sds-azure-platform"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
          + "startupMode"  = "always"
        }

      + managed_rule {
          + action  = "Block"
          + type    = "DefaultRuleSet"
          + version = "1.0"
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin["juror-public"] will be created
  + resource "azurerm_cdn_frontdoor_origin" "front_door_origin" {
      + cdn_frontdoor_origin_group_id  = (known after apply)
      + certificate_name_check_enabled = true
      + enabled                        = true
      + health_probes_enabled          = (known after apply)
      + host_name                      = "firewall-prod-int-palo-sdsstg.uksouth.cloudapp.azure.com"
      + http_port                      = 80
      + https_port                     = 443
      + id                             = (known after apply)
      + name                           = "juror-public"
      + origin_host_header             = "juror-public.staging.platform.hmcts.net"
      + priority                       = 1
      + weight                         = 50
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_origin.front_door_origin["staging-immigrationappealsonline"] will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_origin" "front_door_origin" {
      ~ host_name                      = "dualstack.iacfees-s-elbhmcts-dgd2ej56uxef-715536071.eu-west-1.elb.amazonaws.com" -> "dualstack.iacfees-s-ELBhmcts-DGD2EJ56UXEF-715536071.eu-west-1.elb.amazonaws.com"
        id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/originGroups/staging-immigrationappealsonline/origins/staging-immigrationappealsonline"
        name                           = "staging-immigrationappealsonline"
        # (9 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_origin_group.origin_group["juror-public"] will be created
  + resource "azurerm_cdn_frontdoor_origin_group" "origin_group" {
      + cdn_frontdoor_profile_id                                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg"
      + id                                                        = (known after apply)
      + name                                                      = "juror-public"
      + restore_traffic_time_to_healed_or_new_endpoint_in_minutes = 10
      + session_affinity_enabled                                  = false

      + load_balancing {
          + additional_latency_in_milliseconds = 0
          + sample_size                        = 4
          + successful_samples_required        = 2
        }
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_A["juror-public"] will be created
  + resource "azurerm_cdn_frontdoor_route" "routing_rule_A" {
      + cdn_frontdoor_custom_domain_ids = (known after apply)
      + cdn_frontdoor_endpoint_id       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/afdEndpoints/sdshmcts-stg"
      + cdn_frontdoor_origin_group_id   = (known after apply)
      + cdn_frontdoor_origin_ids        = (known after apply)
      + enabled                         = true
      + forwarding_protocol             = "HttpOnly"
      + https_redirect_enabled          = false
      + id                              = (known after apply)
      + link_to_default_domain          = false
      + name                            = "juror-public"
      + patterns_to_match               = [
          + "/*",
        ]
      + supported_protocols             = [
          + "Https",
        ]
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_route.routing_rule_B["juror-public"] will be created
  + resource "azurerm_cdn_frontdoor_route" "routing_rule_B" {
      + cdn_frontdoor_custom_domain_ids = (known after apply)
      + cdn_frontdoor_endpoint_id       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/afdEndpoints/sdshmcts-stg"
      + cdn_frontdoor_origin_group_id   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/originGroups/defaultBackend"
      + cdn_frontdoor_origin_ids        = [
          + "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/originGroups/defaultBackend/origins/defaultBackend",
        ]
      + cdn_frontdoor_rule_set_ids      = [
          + "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg/ruleSets/httpsredirect",
        ]
      + enabled                         = true
      + forwarding_protocol             = "MatchRequest"
      + https_redirect_enabled          = false
      + id                              = (known after apply)
      + link_to_default_domain          = false
      + name                            = "juror-publicHttpsRedirect"
      + patterns_to_match               = [
          + "/*",
        ]
      + supported_protocols             = [
          + "Http",
        ]
    }

  # module.premium_front_door.azurerm_cdn_frontdoor_security_policy.security_policy["juror-public"] will be created
  + resource "azurerm_cdn_frontdoor_security_policy" "security_policy" {
      + cdn_frontdoor_profile_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg"
      + id                       = (known after apply)
      + name                     = "jurorpublicstgPremium-securityPolicy"

      + security_policies {
          + firewall {
              + cdn_frontdoor_firewall_policy_id = (known after apply)

              + association {
                  + patterns_to_match = [
                      + "/*",
                    ]

                  + domain {
                      + active                  = (known after apply)
                      + cdn_frontdoor_domain_id = (known after apply)
                    }
                }
            }
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["c100-application"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.c100-application"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "staging.platform.hmcts.net"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["darts-portal"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.darts-portal"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "staging.platform.hmcts.net"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["juror-public"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.juror-public"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "staging.platform.hmcts.net"

      + record {
          + value = (known after apply)
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["pip-frontend"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.pip-frontend"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "staging.platform.hmcts.net"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["pip-frontend-b2c-sign-in"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.sign-in.pip-frontend"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "staging.platform.hmcts.net"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["pip-frontend-b2c-staff"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.staff.pip-frontend"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "staging.platform.hmcts.net"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["portal-stg"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.portal-stg"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "pre-recorded-evidence.justice.gov.uk"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["pre-portal"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.pre-portal"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "staging.platform.hmcts.net"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["sds-api-mgmt"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.sds-api-mgmt"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "staging.platform.hmcts.net"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["staging-casetracker"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.staging"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "casetracker.justice.gov.uk"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["staging-certificatedbailiffs"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.staging"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "certificatedbailiffs.justice.gov.uk"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["staging-courtfines"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.staging"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "courtfines.direct.gov.uk"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["staging-immigrationappealsonline"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.staging"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "immigrationappealsonline.justice.gov.uk"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["toffee"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.toffee"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "staging.platform.hmcts.net"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["vh-admin-web"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.admin"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "staging.hearings.reform.hmcts.net"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_dns_txt_record.public_dns_record["vh-video-web"] will be created
  + resource "azurerm_dns_txt_record" "public_dns_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.video"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "staging.hearings.reform.hmcts.net"

      + record {
          + value = "validated"
        }
    }

  # module.premium_front_door.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
        id                 = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Cdn/profiles/sdshmcts-stg|fd-log-analytics-logs-sa"
        name               = "fd-log-analytics-logs-sa"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 25 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":623,"Program":"tfcmt","SHA1":"","Target":"stg_frontdoor","Vars":{}} -->